$(document).ready(function() {
    $(".popup1").magnificPopup();
    $(".popup2").magnificPopup();
    $(".popup3").magnificPopup();
    $(".popup4").magnificPopup();
    $(".popup5").magnificPopup();
//Получим элементы для обработки, для рендеринга массива arrCountry будем использовать
// объект fragment. Это снизит нагрузку на рендер со всеми вытекающими.
let fieldSearch = document.getElementById('fieldSearch'),
    blockListCountry = document.getElementById('blockListCountry'),
    listCountry = document.getElementById('listCountry'),
    elemListCountry = document.getElementsByClassName('elem-list-country'),
    fragment = document.createDocumentFragment();
 
// сформируем массив со странами. Неважно как мы его получим, будь это ответ с БД, или созданный ручками и т.д.
const arrCountry = ["Абхазия", "Австралия", "Австрия", "Азербайджан", "Албания", "Алжир", "Ангола", "Ангуилья", "Андорра", "Антигуа и Барбуда", "Антильские острова", "Аргентина", "Армения", "Афганистан", "Багамские острова", "Бангладеш", "Барбадос", "Бахрейн", "Беларусь", "Белиз", "Бельгия", "Бенин", "Бермуды", "Болгария", "Боливия", "Босния/Герцеговина", "Ботсвана", "Бразилия", "Бруней", "Буркина Фасо", "Бурунди", "Бутан", "Вануату", "Ватикан", "Великобритания", "Венгрия", "Венесуэла", "Вьетнам", "Виргинские о-ва", "Габон", "Гаити", "Гайана", "Гамбия", "Гана", "Гваделупа", "Гватемала", "Гвинея", "Гвинея-Бисау", "Германия", "Гернси остров", "Гибралтар", "Гондурас", "Гонконг", "Палестина", "Гренада", "Гренландия", "Греция", "Грузия", "Конго", "Дания", "Джерси", "Джибути", "Доминикана", "Египет", "Замбия", "Зимбабве", "Израиль", "Индия", "Индонезия", "Иордания", "Ирак", "Иран", "Ирландия", "Исландия", "Испания", "Италия", "Йемен", "Кабо-Верде", "Казахстан", "Камбоджа", "Камерун", "Канада", "Катар", "Кения", "Кипр", "Китай", "Колумбия", "Конго", "Коста-Рика", "Кот-д'Ивуар", "Куба", "Кувейт", "Кука острова", "Кыргызстан", "Лаос", "Латвия", "Лесото", "Либерия", "Ливан", "Ливия", "Литва", "Лихтенштейн", "Люксембург", "Маврикий", "Мавритания", "Мадагаскар", "Македония", "Малайзия", "Мали", "Мальдивские острова", "Мальта", "Марокко", "Мексика", "Мозамбик", "Молдова", "Монако", "Монголия", "Мьянма", "Мэн о-в", "Намибия", "Непал", "Нигер", "Нигерия", "Нидерланды", "Никарагуа", "Новая Зеландия", "Новая Каледония", "Норвегия", "О.А.Э.", "Оман", "Пакистан", "Палау", "Панама", "Папуа Новая Гвинея", "Парагвай", "Перу", "Питкэрн", "Полинезия", "Польша", "Португалия", "Пуэрто Рико", "Реюньон", "Россия", "Руанда", "Румыния", "США", "Сальвадор", "Самоа", "Сан-Марино", "Сан-Томе и Принсипи", "Саудовская Аравия", "Свазиленд", "Святая Люсия", "Северная Корея", "Сейшеллы", "Сен-Пьер и Микелон", "Сенегал", "Сент Китс и Невис", "Сент-Винсент и Гренадины", "Сербия", "Сингапур", "Сирия", "Словакия", "Словения", "Соломоновы острова", "Сомали", "Судан", "Суринам", "Сьерра-Леоне", "Таджикистан", "Таиланд", "Тайвань", "Танзания", "Того", "Токелау острова", "Тонга", "Тринидад и Тобаго", "Тувалу", "Тунис", "Туркменистан", "Туркс и Кейкос", "Турция", "Уганда", "Узбекистан", "Украина", "Уоллис и Футуна острова", "Уругвай", "Фарерские острова", "Фиджи", "Филиппины", "Финляндия", "Франция", "Хорватия", "Чад", "Черногория", "Чехия", "Чили", "Швейцария", "Швеция", "Шри-Ланка", "Эквадор", "Экваториальная Гвинея", "Эритрея", "Эстония", "Эфиопия", "ЮАР", "Южная Корея", "Южная Осетия", "Ямайка", "Япония"];
 
//Сформируем список стран для элемента listCountry и запихаем во фрагмент.
arrCountry.forEach(e => {
  let elemListCountry = document.createElement('li');
  elemListCountry.textContent = e;
  elemListCountry.className = "elem-list-country";
  fragment.appendChild(elemListCountry);
});
 
//А теперь разом вставим все. Такая нагрузка на рендер будет только один раз. Далее, если вспомнить,
// что список и элементы списка display: none, мы будем просто показывать нужные,
// не нагружая рендер, ведь они уже в DOM. Это обойдется намного дешевле для производительности,
// чем каждый раз filter'ом обходить весь массив, и каждый раз рендерить результат на выдачу.
listCountry.appendChild(fragment);
 
// Теперь обработаем поведение поля и списка
// обработаем поведение input#fieldSearch
const searchCountry = () => {
  //производим проверку на ввод (кириллица, тире, пробел)
  // положительный результат == покажем сам блок со списком(иначе на кой черт нам кастомный вариант)
  blockListCountry.style.display = (fieldSearch.value && fieldSearch.value.match(/[А-Яа-яЁё\s-]+/g)) ? 'block' : 'none';
  //а здесь мы прогуляемся по массиву для того чтобы найти совпадения; нашли => отображаем
  arrCountry.forEach((e,i) => {
    elemListCountry[i].style.display= (e.match(new RegExp(`^${fieldSearch.value}`, 'i'))) ? 'list-item' : 'none';
  });  
},
      // обработаем поведение самого списка
      // нам ведь нужно по клику выбрать нужную страну и поместить результат в поле
      // выделение мы обработали в стилях
      // а вот обработка кнопок нафиг не нужна, ибо для разработчика пользователь априори туп
      //(это конечно не значит что это на самом деле так :) ),
      // поэтому интерфейс и делается как можно проще. Чтобы не напрягать мозги. Иначе весь сайт
      // будет утыкан напоминалками.
      selectCoutnry = e => {
        //чтобы не навешивать обработчик на каждый элемент списка, засирая очередь, мы навесим его на #blockListCountry
        // а дальше просто ловим всплытие
        if (e.target.classList.contains('elem-list-country')) {
          fieldSearch.value = e.target.textContent;
          blockListCountry.style.display='none';
        }
      };
// А теперь просто навесим обработчики на поле и блок списка
fieldSearch.addEventListener('input', searchCountry);
blockListCountry.addEventListener('click', selectCoutnry);
});